[{"title":"10th May 2023","created":"20230510062235159","creator":"raybaq","modified":"20230510074658325","modifier":"raybaq","tags":"Journal","type":"text/vnd.tiddlywiki","text":"I'm trying out the ~NodeJS version of ~TiddlyWiki and I have high hopes that it will work out. The thing is, installing and using it feels just like working with any other Node app. While that's a far cry from the \"wiki in a single html file\" that ~TiddlyWiki was originally, I think it will be something I can get used to.\n\nThought about installing ~ChromeOS Flex on my thinkpad. Had the installer on a usb thumb drive but the drive failed while I was trying out ChromeOS (basically running it from the thumb drive). I then tried using an SD card instead, but couldn't find a way to boot the thinkpad from the SD card. Finally decided never mind--Ubuntu with KDE plasma runs fine on the thinkpad anyway, so I'll just keep it that way.","revision":"0","bag":"default"},{"title":"15th May 2023","created":"20230515115400536","modified":"20230515123339658","tags":"Journal","type":"text/vnd.tiddlywiki","text":"Tried to install the Reveal.js plugin to this wiki (Node version of ~TiddlyWiki). Did not succeed. I have previously done it in the single-file version.\n\nLooked again at approaches to writing a blog (not planning to use ~TiddlyWiki for this, it would be more for longform content). I did one before using Cryogen (https://cryogenweb.org) to generate a static website, then experimented with other approaches, then...left it to bitrot.  Now I want something that will be sustainable with low effort, and at the same time, a learning experience for me.\n","revision":"0","bag":"default"},{"title":"Ascension of the Lord","created":"20230521125718498","modified":"20230521134357728","tags":"SundayMassReadings LiturgicalBibleStudy LBS","type":"text/vnd.tiddlywiki","text":"!!Ac 1,1-11 / Ps 27? / Eph 1,17-23 / Mt 28,16-20\n\n* Ascension -- Jesus translated into the divine realm, after commisioning the disciples to be his witnesses \"in Jerusalem, in all Judea and Samaria, and to the ends of the earth\" upon receiving the promised Holy Spirit\n* Paul prays to God that the Ephesians receive \"a spirit of wisdom and revelation...so that...you may know what is the hope to which he has called you, what are the riches of his glorious inheritance among the saints, and what is the immeasurable greatness of his power for us who believe\"\n* The great commission: \"Go therefore and make disciples of all nations...and remember, I am with you always, to the end of the age\"\n\n!!!Homilies:\n* Geoffrey Plant: https://youtu.be/X_pWxm4hHiw\n* Bishop Barron: https://youtu.be/ktH4PnwWnZ0\n* First Things First (Bp Roderick Pabillo): https://youtu.be/rr1-tJARAFw\n","revision":"0","bag":"default"},{"title":"CIY 130 -- Communion of Saints","created":"20230510064616715","creator":"raybaq","modified":"20230510070023075","modifier":"raybaq","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 946-953\n\n* Communion of Saints: communion in holy things (//sancta//) and communion of holy persons (//sancti//) //Sancta sanctis!// \"God's holy gifts for God's holy people\"\n* Communion in the faith: faith of the Church received from the apostles\n* Communion of the sacraments: all the sacraments are sacred links uniting the faithful to one another and binding them to Jesus Christ\n* Communion in charisms\n* Everything in common: \"All Christians should be ready and eager to come to the help of the needy...and of their neighbors in want\" \n* Communion in charity","revision":"0","bag":"default"},{"title":"CIY 131 -- The Communion of the Church","created":"20230511092853226","modified":"20230511094110441","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para  954-962\n\n* 3 States of the Church\n** Triumphant\n** Militant\n** Penitent\n* Intercession of the Saints\n* Communion with the Saints\n* Communion with the dead\n* One family of God\n","revision":"0","bag":"default"},{"title":"CIY 132 -- Mary, Mother of the Church","created":"20230512020938805","modified":"20230512054423619","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 963-970\n\n* Mary united to Christ from conception to death on the cross\n** given to Christ's beloved disciples with the words \"Woman, behold your son...behold your mother\"\n* Mary, our mother in the order of grace\n** model of faith and charity\n** after her assumption, contines by her intercession to bring us the gifts of eternal salvation\n ","revision":"0","bag":"default"},{"title":"CIY 133 -- Devotion to Mary","created":"20230513074031667","modified":"20230513075443363","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 971-975\n\n* Devotion to the Blessed Virgin (//hyperdulia//) is intrinsic to Christian worship\n** fosters adoration of God (//latria//) \n* Mary -- eschatological icon of the Church\n* Mary continues in heaven to exercise her maternal role on behalf of the members of Christ\n","revision":"0","bag":"default"},{"title":"CIY 134 -- The Forgiveness of Sins","created":"20230514085728540","modified":"20230514091202125","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 976-987\n\n* Forgiveness of sins associated with faith in the Holy Spirit, the Church, and the Communion of Saints\n* Sins forgiven in the sacraments of Baptism and Penance\n* \"Power of the keys\": Christ gave the power of forgiveness of sins to the Church; normally exercised by bishops and priests in the sacrament of Penance\n","revision":"0","bag":"default"},{"title":"CIY 135 -- The Resurrection of the Body","created":"20230515111549670","modified":"20230515113018573","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 988-996\n\n* Just as Christ is truly risen from the dead and lives forever, so after death the righteous will live forever with the risen Christ and he will raise them up on the last day\n* Resurrection work of the Holy Trinity\n* Idea of resurrection revealed progressively\n* Linked by Christ to his own person; witnessed by his disciples after he rose from the dead","revision":"0","bag":"default"},{"title":"CIY 136 -- Questions of Resurrection","created":"20230516085214447","modified":"20230516091011912","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 997-1004\n\n* In death, the soul is separated from the body, which decays. In resurrection, the soul is reunited with the (glorified) body\n* All will rise, either to resurrection of life or resurrection of judgment, on the last day\n* In a certain way, we have already risen with Christ; Christian life is now already a participation in the death and resurrection of Christ\n","revision":"0","bag":"default"},{"title":"CIY 137 -- Dying in Christ Jesus","created":"20230517102018138","modified":"20230517111147721","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"!!para 1005-1011\n\n* Death is \n** the end of earthly life\n** a consequence of sin\n** transformed by Jesus Christ: through Baptism, the christian has \"died with Christ\" and dying in Christ's grace completes the incorporation into Christ (to share in his resurrection)\n* \"I want to see God, and in order to see him, I must die\" (St. Teresa of Avila)\n* \"I am not dying. I am entering life\" (St. Therese of the Child Jesus)\n","revision":"0","bag":"default"},{"title":"CIY 138 -- Resurrection of the Body","created":"20230518083401123","modified":"20230518100805750","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"!!para 1012-1019\n\n* No reincarnation\n* \"We believe in God who is the creator of the flesh; we believe in the Word made flesh in order to redeem the flesh; we believe in the resurrection of the flesh, the fulfillment of both the creation and the redemption of the flesh\"\n\n","revision":"0","bag":"default"},{"title":"CIY 139 -- Life Everlasting","created":"20230519061920055","modified":"20230519063421930","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"para 1020-1029\n\n* The Christian who unites his own death to that of Jesus views it as a step towards him and an entrance into everlasting life\n* Particular judgment--refers [the Christian's] life to Christ:either entrance into the blessedness of heaven--through a purification or immediately--or immediate and everlasting damnation\n* Heaven: the ultimate end and fulfillment of the deepest human longings, the state of supreme, definitive happiness\n* By his death and Resurrection, Jesus Christ has \"opened\" heaven for us \n\n","revision":"0","bag":"default"},{"title":"CIY 140 -- Purgatory and Hell","created":"20230520115723876","modified":"20230520115948908","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"!!para 1030-1037\n\n* Purgatory: all who die in God's grace and friendship but still imperfectly purified are assured of salvation but must undergo purification\n* Hell: definitive self-exclusion from communion with God and the blessed\n* Church teaching on hell is:\n** a call to responsibility\n** an urgent call to conversion\n* No predestination\n","revision":"0","bag":"default"},{"title":"CIY 141 -- The Last Judgment","created":"20230521123757691","modified":"20230521125635053","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"!!para 1038-1041\n\n* Last Judgment follows the resurrection of the dead\n* \"In the presence of Christ, who is Truth itself, the truth of each man's relationship with God is laid bare\"\n* Last Judgment comes when Christ returns in glory. No one knows the day or the hour\n\n","revision":"0","bag":"default"},{"title":"CIY 142 -- The New Heaven and the New Earth","created":"20230522122303079","modified":"20230522124015123","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"!!para 1042-1050\n\n* After the universal judgment, fullness of the Kingdom of God (new heavens and a new earth)\n* God dwelling among men\n* Beatific vision\n* Visible universe destined to be redeemed","revision":"0","bag":"default"},{"title":"CIY 143 -- Amen","created":"20230523060604801","modified":"20230523062118292","tags":"CatechismInAYear","type":"text/vnd.tiddlywiki","text":"!!para 1051-1065\n\n* Particular judgment\n* Communion of saints\n* Purgatory\n* Hell\n* Last Judgment\n* New heavens and a new earth\n* Amen (same root in Heb. as \"believe\")\n** Is. \"God of truth\" literally \"God of the Amen\")\n** Jesus the definitive Amen of the Father's love for us\n","revision":"0","bag":"default"},{"title":"Easter 6th Sunday","created":"20230512054540269","modified":"20230514092110903","tags":"SundayMassReadings LiturgicalBibleStudy LBS","type":"text/vnd.tiddlywiki","text":"Ac 8,5-8.14-17 / Ps 66 / 1Pt 3,15-18 / Jn 14,15-21\n\n* Samartians converted by Philip's preaching and works; Peter and John lay their hands on the baptized converts and they receive the Holy Spirit (baptism and confirmation)\n* Farewell discourse: promise of the Holy Spirit\n* Fr. Geoffrey Plant's homily: https://youtu.be/vqM0Nje10MA\n* Bishop Baron's Sunday sermon: https://youtu.be/PbMGNb_0PDM\n\n","revision":"0","bag":"default"},{"title":"Easter Week 5 Friday","created":"20230512104407022","modified":"20230512110216419","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"Ac 15,22-31 / Ps 57 / Jn 15,12-17\n\n* The Jerusalem council concludes by sending a letter to the church at Antioch together with Judas (Barsabbas) and Silas, who accompany Paul and Barnabas on their return journey\n* Farewell discourse: new commandment of love  ","revision":"0","bag":"default"},{"title":"Easter Week 5 Saturday","created":"20230513075541139","modified":"20230513081640902","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"Ac 16,1-10 / Ps 100 / Jn 15,18-21\n\n* Paul, accompanied by Timothy (whom he had circumcised, because his father was Greek), brings the gospel to Asia and is invited to Macedonia in a vision\n* Jesus tells his disciples to expect hatred and persecution because 'no slave is greater than his master'\n** The //world// is both the opposition to the work of Jesus and the community of his followers, and the area where that work takes place (note from Jewish Annotated NT)\n","revision":"0","bag":"default"},{"title":"Easter Week 5 Thursday","created":"20230511114231866","modified":"20230511115857705","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"Ac15,7-21 / Ps 96 / Jn 15,9-11\n\n* After much debate, Peter and James speak, and the council agrees not to require that gentile converts to Christianity follow the entire Torah, but only to be bound by the covenant with Noah\n* \"As the Father has loved me, so have I loved you; abide in my love. If you keep my commandments, you will abide in my love, jus tas I have kept my Father's commandments and abide in his love.\"\n","revision":"0","bag":"default"},{"title":"Easter Week 5 Wednesday","created":"20230510070716120","creator":"raybaq","modified":"20230510073522891","modifier":"raybaq","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"Ac 15,1-6; Ps 122; Jn 15,1-8\n\n* Council in Jerusalem regarding the question of circumcision for gentile converts to Christianity\n* Jesus said to his disciples: \"I am the vine, you are the branches. Those who abide in me and I in them bear much fruit...\"","revision":"0","bag":"default"},{"title":"Easter Week 6, Monday","created":"20230515113050947","modified":"20230515115348276","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"Ac 16,11-15 / Ps 149 / Jn 15,26-27.16,1-4a\n\n* In Philippi, Paul encounters Lydia who is converted and invites paul's party to stay at her home\n* \"When the Advocate comes, whom I will send to you from the Father, the Spirit of truth who comes from the Father, he will testify on my behalf. You also will testify...\"\n\n","revision":"0","bag":"default"},{"title":"Easter Week 6, Saturday","created":"20230520120253005","modified":"20230520123005136","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"!!Ac 18,23-28 / Ps 47 / Jn16,23b-28\n\n* Paul embarks on his third missionary journey; Apollos in Ephesus was instructed more accurately in the Way by Aquila and Priscilla (he knew only the baptism of John) and becomes a zealous preacher and missionary with their support\n* Jesus said to his disciples:\"amen, amen, I say to you, whatever you ask the Father in my name he will give you...ask and you will receive, so that your joy may be complete.\"\n","revision":"0","bag":"default"},{"title":"Easter Week 6, Thursday","created":"20230518104715095","modified":"20230518110521361","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"!! Ac 18,1-8 / Ps 98 / Jn 16,16-20\n\n* Paul establishes the church in Corinth\n* Jesus tells his disciples in veiled language of his death and resurrection: \"...you have pain now, but I will see you again and your hearts will rejoice, and no one will take your joy from you\"\n\n","revision":"0","bag":"default"},{"title":"Easter Week 6, Tuesday","created":"20230516091014437","modified":"20230516095252045","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"Ac 16,22-24 / Ps 138 / Jn 16,5-11\n\n* Paul and Silas are beaten and thrown in jail but spend the evening praying and singing hymns. An earthquake shakes the prison and opens all the locked doors. paul uses the occasion to bring the jailer and his family to Christ\n* \"If I do not go away, the Advocate will not come to you; but if I go, I will send him to you. and when he goes, he will prove the world wrong about sin and righteousness and judgment; about sin because they do not believe me; about righteousness because I am going to the Father and you will see me no longer; and about judgment because the ruler of this world has been condemned\"\n","revision":"0","bag":"default"},{"title":"Easter Week 6, Wednesday","created":"20230517105223674","modified":"20230517111406918","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"!! Ac 17,15.22-34.18,1 / Ps 148 / Jn 16,12-15\n\n* At the Areopagus, Paul introduces to the Athenians the Unknown God and his chosen one, the resurrected Jesus\n* \"...when he comes, the Spirit of truth, he will guide you in all truth\"\n","revision":"0","bag":"default"},{"title":"Easter Week 7, Monday","created":"20230522124020011","modified":"20230522125611766","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"!!Ac19,1-8 / Ps 68 /Jn 16,29-33\n\n* In Ephesus, Paul encounters disciples who had not received the Holy Spirit, having only received the baptism of John. He baptizes them in the name of Jesus and \"when Paul had laid his hands on them, the Holy Spirit came upon them...\"\n* Jesus said to his disciples: \"In the world you face persecution. but take courage; I have conquered the world!\n  ","revision":"0","bag":"default"},{"title":"Easter Week 7, Tuesday","created":"20230523112936255","modified":"20230523115657020","tags":"DailyMassReadings","type":"text/vnd.tiddlywiki","text":"!!Ac 20,17-27 / Ps 68 / Jn 17,1-11a\n\n* Paul says farewell to the elders of Ephesus\n* Jesus' high priestly prayer: \"This is eternal life, that they may know you, the only true God and Jesus Christ whom you have sent\n","revision":"0","bag":"default"},{"created":"20230524112025432","text":"!!Ac 20,28-38 / Ps 68 / Jn 17,11b-19\n\n* Paul exhorts the elders of Ephesus to keep watch over their flock, beware of false prophets and follow the Lord's admonition that it is more blessed to give than to receive\n* Jesus prays to the Father that his disciples may be protected from the evil one \n","tags":"DailyMassReadings","title":"Easter Week 7, Wednesday","modified":"20230524113747916"}]